11/data/attachments/de3aa5ec6a68378b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f44feef8-80c9-46ad-b346-0d43c6c31f8f</nif:username>
            <nif:friendToBeAdded>Todd_little_Friend_21673_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>